views/barang/index.php


    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'id',
            'nama',
            'satuan',
            'harga',
            'id_group',
            [
                'label' => 'Total Stok',
                'value' => function ($model) {
                    // Menjumlahkan seluruh stok barang ini dari semua outlet
                    return \app\models\StokBarang::find()
                        ->where(['id_barang' => $model->id])
                        ->sum('jumlah_stok') ?? 0;},
            ],
            //'id_stock_rak',
            //'id_ppn',
            [
                'class' => ActionColumn::className(),
                'urlCreator' => function ($action, Barang $model, $key, $index, $column) {
                    return Url::toRoute([$action, 'id' => $model->id]);
                 }
            ],
        ],
    ]); ?>
---
SELECT * FROM `barang` LIMIT 20
SELECT COUNT(*) FROM `barang`
SELECT * FROM `group` WHERE `id`=2
SELECT SUM(jumlah_stok) FROM `stok_barang` WHERE `id_barang`=4
SELECT * FROM `group`