controllers/SiteController.php

SELECT * FROM `outlet`
SELECT * FROM `outlet` WHERE `id`=1
SELECT * FROM `stok_barang` WHERE `id_outlet`=1
SELECT * FROM `barang`
---
    public function actionIndex($id_outlet = null)
    {
        // Jika yang membuka halaman utama adalah Admin, langsung lempar ke Laporan Omset
        if ($this->isAdmin()) {
            return $this->redirect(['transaksi/laporan']);
        }

        $outlets = Outlet::find()->all();

        // Tentukan outlet yang dipilih (default ke outlet pertama jika tidak ada)
        if (!$id_outlet && !empty($outlets)) {
            $id_outlet = $outlets[0]->id;
        }

        $selectedOutlet = Outlet::findOne($id_outlet);

        // Ambil semua barang dan relasi stoknya pada outlet yang dipilih
        $stokBarang = StokBarang::find()
            ->where(['id_outlet' => $id_outlet])
            ->indexBy('id_barang')
            ->all();

        $barangs = Barang::find()->all();