controllers/TransaksiController.php

SELECT SUM(total_harga) FROM `transaksi` WHERE `transaksi`.`status`='SUCCESS'
SELECT COUNT(*) FROM `transaksi` WHERE `transaksi`.`status`='SUCCESS'
SELECT DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m') AS `bulan_key`, DATE_FORMAT(transaksi.tgl_transaksi, '%M %Y') AS `bulan_label`, SUM(transaksi.total_harga) AS `total` FROM `transaksi` WHERE `transaksi`.`status`='SUCCESS' GROUP BY DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m'), DATE_FORMAT(transaksi.tgl_transaksi, '%M %Y') ORDER BY DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m')
---
    public function actionLaporan()
    {
        $user = Yii::$app->user->identity;

        if ($user && ($user->isKasir() || $user->isGudang())) {
            Yii::$app->session->setFlash('warning', 'Halaman tidak ditemukan.');
            return $this->redirect(['/transaksi/create']);
        }

        $query = Transaksi::find()
            ->where(['transaksi.status' => 'SUCCESS']);

        if ($user && $user->isManager()) {
            $query->andWhere(['transaksi.id_outlet' => $user->id_outlet]);
            $idOutlet = $user->id_outlet;
        } else {
            $idOutlet = Yii::$app->request->get('id_outlet');
            if ($idOutlet) {
                $query->andWhere(['transaksi.id_outlet' => $idOutlet]);
            }
        }

        $totalOmset = (clone $query)->sum('total_harga') ?? 0;
        $totalTransaksi = (clone $query)->count();

        $trendQuery = (clone $query)
            ->select([
                'bulan_key'   => "DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m')",
                'bulan_label' => "DATE_FORMAT(transaksi.tgl_transaksi, '%M %Y')",
                'total'       => 'SUM(transaksi.total_harga)'
            ])
            ->groupBy([
                "DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m')",
                "DATE_FORMAT(transaksi.tgl_transaksi, '%M %Y')"
            ])
            ->orderBy(["DATE_FORMAT(transaksi.tgl_transaksi, '%Y-%m')" => SORT_ASC])
            ->asArray()
            ->all();

SELECT `outlet`.`nama` AS `nama_outlet`, SUM(transaksi.total_harga) AS `total` FROM `transaksi` LEFT JOIN `outlet` ON `transaksi`.`id_outlet` = `outlet`.`id` WHERE `transaksi`.`status`='SUCCESS' GROUP BY `transaksi`.`id_outlet`, `outlet`.`nama` ORDER BY `total` DESC
---
            $bulanOmset[] = (float)$t['total'];
        }

        $outletQuery = (clone $query)
            ->select([
                'nama_outlet' => 'outlet.nama',
                'total'       => 'SUM(transaksi.total_harga)'
            ])
            ->joinWith('outlet')
            ->groupBy(['transaksi.id_outlet', 'outlet.nama'])
            ->orderBy(['total' => SORT_DESC])
            ->asArray()
            ->all();

SELECT * FROM `transaksi` WHERE `id`='109'
---
    protected function findModel($id) {
        if (($model = Transaksi::findOne(['id' => $id])) !== null) {