views/transaksi/view.php

SELECT * FROM `detail_transaksi` WHERE `id_transaksi`=109
---
/* @var $model app\models\Transaksi */

$this->title = 'Nota Transaksi: ' . $model->no_nota;
$details = DetailTransaksi::find()->where(['id_transaksi' => $model->id])->all();